In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [1,2,3]

In [3]:
a = np.array(data)

In [4]:
type(a)

numpy.ndarray

In [5]:
b = pd.Series(data)

In [6]:
type(b)

pandas.core.series.Series

In [7]:
c = pd.Series([2,3,4])

In [8]:
b.T@c

20

In [9]:
dic = {"이름":['김수안','김수정','박동윤','강이안','강지안'],
        "나이":[19,23,22,19,16],
      "성별" : ['여','여','남','여','남'],
        "평점" : [4.35,4.23,4.45,4.37,4.25]}

In [10]:
data = pd.DataFrame(dic)

In [11]:
data.dtypes

이름     object
나이      int64
성별     object
평점    float64
dtype: object

In [12]:
data_list = [['김수안',19,'여',4.35],['김수정',23,'여',4.23],['박동윤',22,'남',4.45]]

In [13]:
data = pd.DataFrame(data_list,index = ['a','b','c'],columns = ['이름','나이','성별','평점'])

In [14]:
data.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
data

    이름  나이 성별    평점
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45

In [16]:
data.drop(['성별'],axis =1 , inplace = True)

In [17]:
data['연락처'] = [None,None,None]

In [18]:
data.any(axis=0) #행값에 널값이 있으면 트루

이름      True
나이      True
평점      True
연락처    False
dtype: bool

In [19]:
data.isna().any(axis=0) #전체 데이터중에 모든 값이 널값인 변수인가?

이름     False
나이     False
평점     False
연락처     True
dtype: bool

In [21]:
data.sum(axis=0)

이름     김수안김수정박동윤
나이            64
평점         13.03
연락처            0
dtype: object

In [20]:
data.isna().sum() #널값의 갯수

이름     0
나이     0
평점     0
연락처    3
dtype: int64

In [31]:
data.dropna(axis=0,how='any',inplace = True) #axis : 어떤 기준으로 , how : 어떤 방식으로
# any : 하나라도 널값이면 널값 삭제
# all : 모든 값이 널값이어야 삭제

In [21]:
data.fillna(value = '없음')

    이름  나이    평점 연락처
a  김수안  19  4.35  없음
b  김수정  23  4.23  없음
c  박동윤  22  4.45  없음

In [22]:
data2 = data[['나이','평점']]

In [23]:
data2

   나이    평점
a  19  4.35
b  23  4.23
c  22  4.45

In [25]:
data2.sum(axis=0, skipna = True)

나이    64.00
평점    13.03
dtype: float64

In [26]:
data2.mean()

나이    21.333333
평점     4.343333
dtype: float64

In [27]:
data2.describe()

              나이        평점
count   3.000000  3.000000
mean   21.333333  4.343333
std     2.081666  0.110151
min    19.000000  4.230000
25%    20.500000  4.290000
50%    22.000000  4.350000
75%    22.500000  4.400000
max    23.000000  4.450000

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      int64
 2   평점      3 non-null      float64
 3   연락처     0 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 228.0+ bytes

In [29]:
data2.나이

a    19
b    23
c    22
Name: 나이, dtype: int64

In [33]:
data2.나이 = data2.나이.astype('float64')

/private/var/mobile/Containers/Data/Application/C5D4B1DC-6421-4D44-8355-D3EE2285C2CD/tmp/ipykernel_8206/3912349286.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2.나이 = data2.나이.astype('float64')

In [34]:
data2.나이

a    19.0
b    23.0
c    22.0
Name: 나이, dtype: float64

In [35]:
data2.corr()

          나이        평점
나이  1.000000 -0.290742
평점 -0.290742  1.000000

In [36]:
data2.cov()

          나이        평점
나이  4.333333 -0.066667
평점 -0.066667  0.012133

In [38]:
data.sort_index(ascending = False)

    이름  나이    평점   연락처
c  박동윤  22  4.45  None
b  김수정  23  4.23  None
a  김수안  19  4.35  None

In [41]:
data.sort_values(by = ['나이', '평점'])

    이름  나이    평점   연락처
a  김수안  19  4.35  None
c  박동윤  22  4.45  None
b  김수정  23  4.23  None

In [ ]:
data.head(1)